blog/app/controllers/articles_controller.rb

  def create
    # puts params[:article].inspect

    # @article = Article.new(params[:article]) <- not secure. can pass in a lot of params
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Article 2"], ["text", "This is the second article being added. A bit more text inside"], ["created_at", "2021-07-29 16:07:11.128476"], ["updated_at", "2021-07-29 16:07:11.128476"]]